In [1]:
import pandas as pd

In [4]:
record1 = pd.Series({'Name' : 'Alice',
           'Class' : 'Physics',
           'Score' : 100})
record2 = pd.Series({'Name': 'Jacke',
                    'Class':'Biology',
                    'Score':45})
record3 = pd.Series({'Name': 'Rm',
                    'Class':'Chemistry',
                    'Score':54})

In [5]:
df = pd.DataFrame([record1,record2,record3],index=['school1','school2','school1'])

In [6]:
df.head()

          Name      Class  Score
school1  Alice    Physics    100
school2  Jacke    Biology     45
school1     Rm  Chemistry     54

In [9]:
students = [{'Name' : 'Alice',
           'Class' : 'Physics',
           'Score' : 100},
            {'Name': 'Jacke',
                    'Class':'Biology',
                    'Score':45},
            {'Name': 'Rm',
                    'Class':'Chemistry',
                    'Score':54}]

In [16]:
df = pd.DataFrame(students,['school1','school2','school1'])

In [17]:
df.head()

          Name      Class  Score
school1  Alice    Physics    100
school2  Jacke    Biology     45
school1     Rm  Chemistry     54

In [18]:
df.loc["school1"]

          Name      Class  Score
school1  Alice    Physics    100
school1     Rm  Chemistry     54

In [19]:
type(df.loc['school2'])

pandas.core.series.Series

In [21]:
df.loc['school1','Name']

school1    Alice
school1       Rm
Name: Name, dtype: object

In [22]:
df.T

       school1  school2    school1
Name     Alice    Jacke         Rm
Class  Physics  Biology  Chemistry
Score      100       45         54

In [23]:
df.T.loc['Name']

school1    Alice
school2    Jacke
school1       Rm
Name: Name, dtype: object

In [24]:
df['Name']

school1    Alice
school2    Jacke
school1       Rm
Name: Name, dtype: object

In [25]:
type(df.Name)

pandas.core.series.Series

In [26]:
df.Name

school1    Alice
school2    Jacke
school1       Rm
Name: Name, dtype: object

In [29]:
type(df.loc['school1']['Class'])

pandas.core.series.Series

In [32]:
df.loc[:,['Name','Score']]

          Name  Score
school1  Alice    100
school2  Jacke     45
school1     Rm     54

In [34]:
df.drop('school2')

          Name      Class  Score
school1  Alice    Physics    100
school1     Rm  Chemistry     54

In [35]:
df

          Name      Class  Score
school1  Alice    Physics    100
school2  Jacke    Biology     45
school1     Rm  Chemistry     54

In [42]:
copy_df = df.copy()

In [43]:
copy_df.drop("Name",inplace=True,axis=1)

In [44]:
copy_df

             Class  Score
school1    Physics    100
school2    Biology     45
school1  Chemistry     54

In [45]:
df['ClassRanking'] = None

In [46]:
df

          Name      Class  Score ClassRanking
school1  Alice    Physics    100         None
school2  Jacke    Biology     45         None
school1     Rm  Chemistry     54         None

In [50]:
df = pd.read_csv('datasets/Admission_Predict.csv')

In [51]:
df.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65

In [55]:
df = pd.read_csv('datasets/Admission_Predict.csv',index_col=0)

In [56]:
df.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [90]:
new_df = df.rename(columns={'GRE Score' : 'GRE Score','TOFEL Score':'TOFEL Score','University Rating' : 'University Rating',
                           'SOP':'Statement of Purpose','LOR':'Letter of Recomendation','CGPA':'CGPA','Research':'Research',
                           'Chance of Admit':'Chance of Admit'})

In [91]:
new_df.head()

,GRE Score,TOEFL Score,University Rating,Statement of Purpose,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [92]:
new_df.columns
new_df=new_df.rename(columns={'LOR ':'Letter of Recomendation'})
new_df.head()

,GRE Score,TOEFL Score,University Rating,Statement of Purpose,Letter of Recomendation,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [97]:
new_df = new_df.rename(mapper=str.strip,axis='columns') #for space remove to make string like lor

In [98]:
new_df.head()

,GRE Score,TOEFL Score,University Rating,Statement of Purpose,Letter of Recomendation,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [99]:
new_df.columns

Index(['GRE Score', 'TOEFL Score', 'University Rating', 'Statement of Purpose',
       'Letter of Recomendation', 'CGPA', 'Research', 'Chance of Admit'],
      dtype='object')

In [100]:
df.columns

Index(['GRE Score', 'TOEFL Score', 'University Rating', 'SOP', 'LOR ', 'CGPA',
       'Research', 'Chance of Admit '],
      dtype='object')

In [102]:
cols = list(df.columns)
cols = [x.lower().strip() for x in cols]
df.columns

Index(['GRE Score', 'TOEFL Score', 'University Rating', 'SOP', 'LOR ', 'CGPA',
       'Research', 'Chance of Admit '],
      dtype='object')